import edication.Exec.Array3.Array;
import edication.Exec.Epam1.Aquarium;
import edication.Exec.Epam1.ArrayExes;
//import edication.Exec.Epam1.ArrayExesxesIRA;
import edication.Exec.Flash5.Flash;
import edication.Exec.LetterGame6.Start;
import edication.Exec.alcgo.lab1.Lab1;
import edication.Exec.stringReplace4.Replace;

public class Main {
    public static void main(String[] args) {
//        ExecString1.start();

//        User user = new User("Ira", 48);
//        System.out.println(user.moonMass());

//        int array[];
//        array = Array.creatArray(5);
//        System.out.println(Array.soutArray(Array.plusTen(array)));

//        String message = "Reveta wont fuck this world";
//        message = Replace.cenzor(message);
//        System.out.println(message);

//        Flash flash = new Flash(7.2);
//        System.out.println(flash.distance());

//        int[] array = {12, 44, 35, 51, 13, 15, 58, 45};
//        System.out.println(ArrayExesIRA.soutArray(array));


//        Aquarium aquariumr;
//        aquariumr = new Aquarium(13,13,14,"glass");
//        aquariumr.addFish("Clown");
//        System.out.println(aquariumr.toString());


        Lab1.start();
    }
}

/*1. Напишите программу, которая считывает символы пока не встретится точка. Также предусмотрите вывод количества пробелов.

2. Сила тяжести на Луне примерно равна 17%, напишите программу, которая вычисляет ваш вес на Луне.

3. Напишите метод, который будет увеличивать заданный элемент массива на 10%.

4. Напишите метод, заменяющий в строке все вхождения слова «бяка» на «вырезано цензурой».

5. Расчет расстояния до места удара молнии. Звук в воздухе распространяется со скоростью приблизительно равной 1100 футам в секунду. Зная интервал времени между вспышкой молнии и звуком сопровождающим ее можно рассчитать расстояние. Допустим интервал 7,2 секунды.

6. Создайте простую игру основанную на угадывании букв.
Пользователь должен угадать загаданную букву A-Z введя ее в консоль. Если пользователь угадал букву программа выведет «Right» и игра закончится, если нет, то пользователь продолжит вводить буквы.
(Опционально) Вывести «You’re too low»- если пользователь ввел букву меньше загаданной, «You’re too high»- если пользователь ввел букву больше загаданной.

7. Напишите программу, которая вычислит простые числа в пределах от 2 до 100.
(Опционально) Дополните программу так, чтобы она вычисляла составные числа.

8. Найдите среднее арифметическое массива из 10 элементов типа double.

9. Напишите рекурсивный метод отображающий строку задом на перед.

10. Найдите победителя марафона.
Группа людей участвует в марафоне, их имена и время за которое они пробежали марафон вы можете увидеть ниже.
Ваша задача найти человека, который быстрее всех пробежал дистанцию и вывести его имя и счет.
(Опционально) Найдите человека, который прибежал вторым.

String[] names = { "Elena", "Thomas", "Hamilton", "Suzie", "Phil", "Matt", "Alex", "Emma", "John", "James", "Jane", "Emily", "Daniel", "Neda", "Aaron", "Kate" };

int[] times = { 341, 273, 278, 329, 445, 402, 388, 275, 243, 334, 412, 393, 299, 343, 317, 265 };
Решение*/